IdeaRS.Connections
TimberGussetPlateData Class
Compatible with IDEA StatiCa 0.0
 Represents data for command which creates gusset plate on timber members
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.TimberGussetPlateData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class TimberGussetPlateData : PlateDataBase
The TimberGussetPlateData type exposes the following members.
Constructors
Name | Description
TimberGussetPlateData
Initializes a new instance of the TimberGussetPlateData class
Top
Properties
Name | Description
BoltShearType
CountOfGussetPlates
CountOfMembers
GussetPlateSurfaceOffset
IsActive |  (Inherited from ConnectionCmdData.)
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
ShearPlaneThread
SinglePlateExtension
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
TimberGussetMembers
TimberGussetPlateType
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetShallowCopy |  (Inherited from ConnectionCmdData.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace